In [1]:
import pandas as pd

In [2]:
data = {
    "id": [101, 102, 103],
    "name": ["Alice", "Bob", "Charlie"],
    "salary": [50000, 60000, 55000]
}

In [5]:
df =pd.DataFrame(data)
df

    id     name  salary
0  101    Alice   50000
1  102      Bob   60000
2  103  Charlie   55000

In [6]:
df.columns

Index(['id', 'name', 'salary'], dtype='object')

In [7]:
df.tail(1)

    id     name  salary
2  103  Charlie   55000

In [9]:
data2 = {
    "product": ["Laptop", "Mouse", "Monitor", "Keyboard", "Webcam"],
    "price": [1000, 25, 200, 50, 80],
    "stock": [5, 100, 10, 30, 15]
}

In [10]:
df2 = pd.DataFrame(data2)
df2

    product  price  stock
0    Laptop   1000      5
1     Mouse     25    100
2   Monitor    200     10
3  Keyboard     50     30
4    Webcam     80     15

In [11]:
df2["price"] > 100

0     True
1    False
2     True
3    False
4    False
Name: price, dtype: bool

In [12]:
df2[df2["price"] > 100]

   product  price  stock
0   Laptop   1000      5
2  Monitor    200     10

In [13]:
df2.shape[0]

5

In [16]:
df2["discount_price"]=df2["price"]/2
df2

    product  price  stock  discount_price
0    Laptop   1000      5           500.0
1     Mouse     25    100            12.5
2   Monitor    200     10           100.0
3  Keyboard     50     30            25.0
4    Webcam     80     15            40.0

In [19]:
df2.to_csv('products_list.csv',sep='\t')

In [20]:
df2.to_csv('products_list.csv',index=False)